app/controllers/authentication_controller.rb

SELECT * FROM "users" WHERE ("users"."user_openid" = E'https://www.google.com/accounts/o8/id?id=AItOawnsER3mwmBOOGi01ktrofaxRI418uwijbw') LIMIT 1
---
  def finish_openid_auth
    current_url = url_for(:action => :finish_openid_auth, :only_path => false)
    parameters = params.reject{|k,v|request.path_parameters[k]}
    oidresp = consumer.complete(parameters, current_url)
    case oidresp.status
    when OpenID::Consumer::SUCCESS

      user = User.find(:first, :conditions => { :user_openid => oidresp.identity_url})