app/controllers/lists_controller.rb

SELECT * FROM "lists" WHERE ("lists"."id" = 8 AND ("lists"."deleted" = 'f'))
SELECT * FROM "notes" WHERE ("notes"."list_id" = 1) ORDER BY id desc LIMIT 16 OFFSET 0
SELECT * FROM "notes" WHERE ("notes"."list_id" = 1 AND "notes"."completed" = 'f') ORDER BY id desc LIMIT 21
---
  def show
    list_id = params[:id].to_i

    @list = nil
    #if the user_lists are stored in the cache then get the name of this list
    if user_lists_cached?
      @list = get_cached_list_info(list_id)
    end

    if !@list
      @list = List.find(list_id, :conditions => {:deleted => false})
    end

    if not @list
      flash[:error] = "a list with id #{list_id} wasn't found"
      redirect_to :controller => :errors
    else
      respond_to do | format |
        format.html do
          @page = params.key?(:page) ? params[:page].to_i : 0
          unless fragment_exist?(:controller => :lists, :action => :show, :id => @list[:id], :page => @page, :action_suffix => 'list_notes')
            #get one more record so we know if we should have paging links
            @notes = Note.all(:conditions => { :list_id => @list[:id] }, :limit => 16, :offset => @page * (16 - 1), :order => 'id desc')
          end
        end
        format.rss do
          @notes = Note.all(:conditions => {:list_id => @list[:id], :completed => false}, :limit => 25, :order => 'id desc')

SELECT * FROM "lists" WHERE ("lists"."has_public_url" = 't' AND "lists"."name" = 'default' AND "lists"."user" = 'davidhampgonsalves') LIMIT 1
---
  def show_by_name
    #use the default list if a list name wasn't spesified
    if params.key? :list_name
      list_name = URI.unescape(params[:list_name])
    else
      list_name = 'default'
    end

    #if the user_lists has been initilized and the request if for this user
    #use that instead of going to the database
    if user_lists_cached? and URI.unescape(params[:user]) == user
      @list = user_lists[list_name]
      #if this list dosn't have a public url then they can't access it this way
      if not @list.nil? and not @list[:has_public_url]
        @list = nil
      end
    end

    #if the user lists wasn't found in the users cache then query the database
    if @list.nil?
      @list = List.find(:first, :conditions => { :user => params[:user], :name => list_name, :has_public_url => true})

SELECT * FROM "lists" WHERE ("lists"."id" = 1 AND ("lists"."user" = E'david hamp-gonsalves'))
---
  def edit
    @list = List.find(params[:id], :conditions => { :user => user})

INSERT INTO "lists" ("name", "user", "created_at", "deleted", "deleted_since", "has_public_url") VALUES(E'test', E'david hamp-gonsalves', '2010-10-30 00:04:11.454088', 'f', NULL, 't') RETURNING "id"
---
  def create
    @list = List.new(params[:list])
    #set the current user as the lists user
    @list.user = user


    if @list.save

SELECT * FROM "lists" WHERE ("lists"."id" = 1 AND ("lists"."user" = E'david hamp-gonsalves'))
UPDATE "lists" SET "has_public_url" = 'f' WHERE "id" = 1
---
  def update
    @list = List.find(params[:id], :conditions => { :user => user})

    org_name = @list.name

    #make sure the user isn't trying to change the name of the default list
    if org_name == "default" and params[:list][:name]
      params[:list][:name] = org_name
    end

    if @list.update_attributes(params[:list])

SELECT * FROM "lists" WHERE ("lists"."id" = 4 AND ("lists"."user" = E'david hamp-gonsalves'))
UPDATE "lists" SET "deleted" = 't', "deleted_since" = '2010-11-06 18:23:09.151468', "has_public_url" = 'f' WHERE "id" = 5
---
  def delete
    @list = List.find(params[:id], :conditions => { :user => user})

    if @list.name == 'default'
      flash[:error] = 'you can\'t delete the default list'
      redirect_to(lists_url)
    end

    #mark list as deleted
    @list.update_attributes :deleted => true, :deleted_since => Time.now, :has_public_url => false

SELECT * FROM "lists" WHERE ("lists"."id" = 4 AND ("lists"."user" = E'david hamp-gonsalves'))
UPDATE "lists" SET "deleted" = 'f' WHERE "id" = 4
---
  def undelete
    @list = List.find(params[:id], :conditions => { :user => user})

    #if the user lists exists delete this list entry from it
    if(user_lists)
      #add it to the users lists
      user_lists[@list.name] = deleted_user_lists[@list.name]
      #delete the list from the users deleted lists
      deleted_user_lists.delete @list.name