app/controllers/notes_controller.rb

  def show
    @note = Note.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1494)

  def edit
    @note = Note.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1660)

  def delete
    @note = Note.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1661)

  def complete
    @note = Note.find(params[:id])
    logger.debug('>> ' + request.referer)
    #check that the user owns this list
    if does_user_own? @note
      @note.completed = true
      if @note.save
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1627)
UPDATE "notes" SET "completed" = 't' WHERE "id" = 1627

  def update
    @note = Note.find(params[:id])

    #check that the user owns this list
    if does_user_own? @note
      org_list_id = params[:note][:list_id]
      if @note.update_attributes(params[:note])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1661)
UPDATE "notes" SET "url" = E'test', "description" = E'asdf asdf asdf asdf asdf asdf', "is_private" = 't' WHERE "id" = 1628

  def destroy
    @note = Note.find(params[:id])

    #check that the user owns this list first
    if does_user_own? @note
      @note.list_id
      @note.destroy
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1617)
DELETE FROM "notes" WHERE "id" = 1617