app/controllers/users_controller.rb

  def create
    if not session[:user_openid]
      redirect_to :controller => :login
    end

    @user = User.new(params[:user])
    @user.user_openid = session[:user_openid]

    if @user.save
        flash[:notice] = 'welcome to note feeder ' + @user.user
        flash[:warning] = 'the bookmarklet is the easiest way to save urls and notes, check it out bellow'
        flash[:highlight_bookmarklet] = true

        #log this user in
        login_user @user.user

        #create the default list for this user
        default_list = List.new(:user => @user.user, :name => 'default')
        default_list.save
---
INSERT INTO "users" ("user_openid", "user") VALUES(E'https://www.google.com/accounts/o8/id?id=AItOawn3aVhhSl6eQ4Tt9BVCn3RqwCG61wL4kYw', E'dada') RETURNING "id"
INSERT INTO "lists" ("name", "user", "created_at", "deleted", "deleted_since", "has_public_url") VALUES(E'default', E'dada', '2010-11-06 18:47:47.712603', 'f', NULL, 't') RETURNING "id"

  def is_available
    user_name = params[:user_name]
    msg = {}

    if user_name and user_name.strip != ''
      user = User.find(:first, :conditions => {:user => user_name})
---
SELECT * FROM "users" WHERE ("users"."user" = E'david hamp-gonsalves') LIMIT 1